In [54]:
import pandas as pd

In [55]:
dataset=pd.read_csv(r'E:\Datasets\CSV\clg.csv')

In [56]:
dataset.drop('name',axis=1)
# dataset.drop(['name','class'],axis=1,inplace=True)

   id  age class  session
0   0   22  bscs  2016-20
1   1   24  bscs  2016-20
2   2   22  bscs  2016-20
3   3   24  bscs  2016-20
4   4   23  bscs  2016-20

In [49]:
dataset=pd.read_csv(r'E:\Datasets\CSV\clg.csv')

In [50]:
dataset.loc[dataset.id>=2,['name','age','class']]

     name  age class
2  farhan   22  bscs
3   shela   24  bscs
4   arbaz   23  bscs